products_reviews_app_api/app/controllers/reviews_controller.rb

  def index
    reviews = Review.where(product_id: params[:product_id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]

  def create
    @review = Review.new(review_params)

    if @review.save
---
INSERT INTO "reviews" ("title", "content", "author", "created_at", "updated_at", "product_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Hey! Say! JUMP"], ["content", "Hey! Say! BEST"], ["author", "Hey Say! 7"], ["created_at", "2021-02-25 04:47:57.495232"], ["updated_at", "2021-02-25 04:47:57.495232"], ["product_id", 1]]

  def update
    if @review.update(review_params)
---
UPDATE "reviews" SET "title" = $1, "content" = $2, "author" = $3, "updated_at" = $4 WHERE "reviews"."id" = $5  [["title", "Hey! Say! JUMP"], ["content", "Hey! Say! WORST"], ["author", "Hey Say! 8"], ["updated_at", "2021-02-25 04:49:53.218560"], ["id", 1]]